Music_App/app/models/user.rb

  def self.find_by_credentials(email, password)
    @user = User.find_by(params[:user][:email], params[:user][:password])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "joebumbaca@gmail.com"], ["LIMIT", 1]]

  def reset_session_token
    self.session_token = SecureRandom.urlsafe_base64
    self.save!
---
UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2019-06-06 18:49:36.751757"], ["session_token", "-fS-SZtkLKxINhDp099i1w"], ["id", 1]]