Music_App/app/controllers/bands_controller.rb

  def create
    @band = Band.new(band_params)
    if @band.save!
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Kanny Da Slaya"], ["created_at", "2019-06-06 23:46:45.508137"], ["updated_at", "2019-06-06 23:46:45.508137"]]